{
    "description": "S28 (Renegades) collected/tiered weapon picks from https://www.blueberries.gg/weapons/destiny-2-seasonal-weapons and https://www.blueberries.gg/weapons/destiny-2-weapons-list",
    "name": "Blueberries.gg's S28 (Renegades) weapon picks",
    "data": [
        {
            "description": "All or Nothing has great utility in PvE and can be a real workhorse when taking on large groups of enemies efficiently. This god roll taps into that potential to take the fight to the enemy and quickly take them out in tandem with a strong Guardian build. Pick this roll up with Fluted Barrel to boost the quite low base Handling, and then combine with Light Heatsink in the Battery for a further +10 to Handling and Reload Speed. The main perks here work incredibly well together in Firefly and Thermal Atomization. Precision kills with Firefly cause a damaging explosion to the surrounding enemies and help Reload Speed reach its maximum. Thermal Atomization then finishes off, adding a damage boost after hitting a high heat, which helps with tankier enemies, as they require more shots. Heating the weapon then ends in a high-damage explosion when the foe is defeated. ",
            "hash": 3984776322,
            "name": "GodPvE",
            "plugs": [
                [
                    1840239774
                ],
                [
                    1946186791
                ],
                [
                    3824105627
                ],
                [
                    1909124648
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "540 RPMs were a menace in The Crucible many seasons ago, and All or Nothing does a great job at bringing them back into the conversation. Their fast-firing nature allows them to quickly dip in and out of engagements effectively before opponents can even react.  Start with Arrowhead Brake to tighten up the wide Recoil pattern and then add Tactical Heatsink to the Battery for its sweeping boosts to essential stats in Range, Stability, and Reload Speed. Tie this together first with Keep Away. The key elements are the increases to Range and Accuracy, which will easily take opponents by surprise at how effective this weapon will be at range, paired with accurate and frequent burst fire. Finish off with Headseeker, which pairs perfectly with a Pulse Rifle; its burst fire nature helps enhance any part of the burst that lands south of a precision shot, making follow-up shots more effective in battle. Source: potential drop throughout the Renegades campaign missions and from its reward chests upon completing the missions and sidequests offered through the Tharsis Outpost. After making progress with the local factions following campaign progression, All or Nothing will be focusable for multiple rolls. (masterwork:Range or masterwork:Handling)",
            "hash": 3984776322,
            "name": "GodPvP",
            "plugs": [
                [
                    839105230
                ],
                [
                    769709866
                ],
                [
                    3619207468
                ],
                [
                    460017080
                ],
                [
                    1309453587
                ]
            ],
            "tags": [
                "GodPVP",
                "PVP"
            ]
        },
        {
            "description": "540 RPMs were a menace in The Crucible many seasons ago, and All or Nothing does a great job at bringing them back into the conversation. Their fast-firing nature allows them to quickly dip in and out of engagements effectively before opponents can even react.  Start with Arrowhead Brake to tighten up the wide Recoil pattern and then add Tactical Heatsink to the Battery for its sweeping boosts to essential stats in Range, Stability, and Reload Speed. Most wants Range and Accuracy. Source: potential drop throughout the Renegades campaign missions and from its reward chests upon completing the missions and sidequests offered through the Tharsis Outpost. After making progress with the local factions following campaign progression, All or Nothing will be focusable for multiple rolls. (masterwork:Range or masterwork:Handling)",
            "hash": 3984776322,
            "name": "PvP",
            "plugs": [
                [
                    839105230
                ],
                [
                    769709866
                ],
                [
                    3619207468,
                    2387244414
                ],
                [
                    460017080,
                    1015611457
                ],
                [
                    1309453587
                ]
            ],
            "tags": [
                "PVP"
            ]
        },
        {
            "description": "All or Nothing has great utility in PvE and can be a real workhorse when taking on large groups of enemies efficiently. This god roll taps into that potential to take the fight to the enemy and quickly take them out in tandem with a strong Guardian build. Pick this roll up with Fluted Barrel to boost the quite low base Handling, and then combine with Light Heatsink in the Battery for a further +10 to Handling and Reload Speed. The main perks here work incredibly well together in Firefly and Thermal Atomization. Precision kills with Firefly cause a damaging explosion to the surrounding enemies and help Reload Speed reach its maximum. Thermal Atomization then finishes off, adding a damage boost after hitting a high heat, which helps with tankier enemies, as they require more shots. Heating the weapon then ends in a high-damage explosion when the foe is defeated. ",
            "hash": 3984776322,
            "name": "PvE (alt)",
            "plugs": [
                [
                    1840239774,
                    839105230,
                    4090651448
                ],
                [
                    1946186791,
                    769709866
                ],
                [
                    3824105627
                ],
                [
                    1909124648,
                    960997401
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "description": "PvE (Min). All or Nothing has great utility in PvE and can be a real workhorse when taking on large groups of enemies efficiently. The main perks here work incredibly well together in Firefly and Thermal Atomization. Precision kills with Firefly cause a damaging explosion to the surrounding enemies and help Reload Speed reach its maximum. Thermal Atomization then finishes off, adding a damage boost after hitting a high heat, which helps with tankier enemies, as they require more shots. Heating the weapon then ends in a high-damage explosion when the foe is defeated. ",
            "hash": 3984776322,
            "name": "PvE (min)",
            "plugs": [
                [
                    3824105627
                ],
                [
                    1909124648,
                    960997401
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "description": "(PvE)(major god): A-Tier. Recommended MW: Handling. Efficient workhorse for large groups of enemies. Firefly (precision kills trigger explosion and nearly maxes out Reload Speed) synergizes well with Thermal Atomization (keeping heat>=50% buffs damage and kills trigger high-damage explosion). Best barrel/mag: Fluted Barrel to boost quite low base Handling, Light Heatsink for more Handling and Reload Speed.",
            "hash": 2023002233,
            "name": "(PvE)(major god)",
            "plugs": [
                [
                    1840239774
                ],
                [
                    1946186791
                ],
                [
                    3824105627
                ],
                [
                    1909124648
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "(PvE)(minor god): A-Tier. Recommended MW: Handling. Efficient workhorse for large groups of enemies. Firefly (precision kills trigger explosion and nearly maxes out Reload Speed) synergizes well with Thermal Atomization (keeping heat>=50% buffs damage and kills trigger high-damage explosion). Any barrel/mag that improves Handling and/or Reload Speed.",
            "hash": 2023002233,
            "name": "(PvE)(minor god)",
            "plugs": [
                [
                    1840239774,
                    4090651448,
                    839105230
                ],
                [
                    1946186791,
                    769709866
                ],
                [
                    3824105627
                ],
                [
                    1909124648,
                    960997401
                ]
            ],
            "tags": [
                "PVE",
                "GodPVE"
            ]
        },
        {
            "description": "(PvE)(basic): A-Tier. Recommended MW: Handling. Efficient workhorse for large groups of enemies. Firefly (precision kills trigger explosion and nearly maxes out Reload Speed) synergizes well with Thermal Atomization (keeping heat>=50% buffs damage and kills trigger high-damage explosion). Minimum roll accepting any barrel/mag we can get.",
            "hash": 2023002233,
            "name": "(PvE)(basic)",
            "plugs": [
                [
                    3824105627
                ],
                [
                    1909124648,
                    960997401
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "description": "(PvE)(major god): A-Tier. Recommended MW: Handling. Efficient workhorse for large groups of enemies. Firefly (precision kills trigger explosion and nearly maxes out Reload Speed) synergizes well with Thermal Atomization (keeping heat>=50% buffs damage and kills trigger high-damage explosion). Best barrel/mag: Fluted Barrel to boost quite low base Handling, Light Heatsink for more Handling and Reload Speed. Best origin trait: Accelerated Assault (sustained damage slightly improves damage and reduces heat generation).",
            "hash": 2023002233,
            "name": "(PvE)(godliest)",
            "plugs": [
                [
                    1840239774
                ],
                [
                    1946186791
                ],
                [
                    3824105627
                ],
                [
                    1909124648
                ],
                [
                    3713579091
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "(Best)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: Fluted Barrel for QoL (handling, range, stability). Mag: Ionized Heatsink for best reducing heat generation from its very high basestat of 90 (target 60).  Prefer Destabilizing Rounds but Cooling Baubles is a solid alternative for dealing with heat buildup.",
            "hash": 2819552809,
            "name": "(Best)(PvE) Compact Defender for damage",
            "plugs": [
                [
                    1840239774
                ],
                [
                    807993149
                ],
                [
                    2048641572,
                    3932949589
                ],
                [
                    1909124648,
                    2109543898
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "(Best)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: Fluted Barrel for QoL (handling, range, stability). Mag: Ionized Heatsink for best reducing heat generation from its very high basestat of 90 (target 60). Destabilizing Rounds pairs very well with Repulsor Brace for generating overshield.",
            "hash": 2819552809,
            "name": "(Best)(PvE) Compact Defender for overshield",
            "plugs": [
                [
                    1840239774
                ],
                [
                    807993149
                ],
                [
                    2048641572
                ],
                [
                    776531651
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "Best (PvP)(Tier:B)(MW:Range) Low range so prioritize range and stability. Barrel: Smallbore. Mag: Particle Repeater. Perk 1: prefer Range Finder for +10 Range on ADS. Perk 2: Kill Clip (neutral build) or Desperate Measures (good for melee/grenade builds).",
            "hash": 2819552809,
            "name": "(Best)(PvP) Compact Defender ",
            "plugs": [
                [
                    1482024992
                ],
                [
                    3868766766
                ],
                [
                    2846385770
                ],
                [
                    1015611457,
                    2109543898
                ]
            ],
            "tags": [
                "GodPVP",
                "PVP"
            ]
        },
        {
            "description": "(Good)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: prefer Fluted Barrel, else select for QoL (handling, range, stability). Mag: prefer Ionized Heatsink for best reducing heat generation from its very high basestat of 90 (target 60), else next best reducing heat generation or improving cooling efficiency. Prefer Destabilizing Rounds but Cooling Baubles is a solid alternative for dealing with heat buildup.",
            "hash": 2819552809,
            "name": "(Good)(PvE) Compact Defender for damage",
            "plugs": [
                [
                    1840239774,
                    4090651448,
                    3250034553,
                    1392496348
                ],
                [
                    807993149
                ],
                [
                    2048641572,
                    3932949589
                ],
                [
                    1909124648,
                    2109543898
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "(Good)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: prefer Fluted Barrel, else select for QoL (handling, range, stability). Mag: prefer Ionized Heatsink for best reducing heat generation from its very high basestat of 90 (target 60), else next best reducing heat generation or improving cooling efficiency. Destabilizing Rounds pairs very well with Repulsor Brace for generating overshield.",
            "hash": 2819552809,
            "name": "(Good)(PvE) Compact Defender for overshield",
            "plugs": [
                [
                    1840239774,
                    4090651448,
                    3250034553,
                    1392496348
                ],
                [
                    807993149
                ],
                [
                    2048641572
                ],
                [
                    776531651
                ]
            ],
            "tags": [
                "GodPVE",
                "PVE"
            ]
        },
        {
            "description": "(Good)(PvP)(Tier:B)(MW:Range) Low range so prioritize range and stability. Barrel: Prefer Smallbore, else best range and stability. Mag: Particle Repeater, else best range and stability. Perk 1: prefer Range Finder for +10 Range on ADS else Delicate Tuning but pace shots to keep heat below 50%. Perk 2: Kill Clip (neutral build) or Desperate Measures (good for melee/grenade builds).",
            "hash": 2819552809,
            "name": "(Good)(PvP) Compact Defender ",
            "plugs": [
                [
                    1482024992,
                    4090651448,
                    3250034553,
                    1392496348
                ],
                [
                    3868766766,
                    2969185026,
                    769709866
                ],
                [
                    2846385770,
                    307683764
                ],
                [
                    1015611457,
                    2109543898
                ]
            ],
            "tags": [
                "GodPVP",
                "PVP"
            ]
        },
        {
            "description": "(Good)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: prefer Fluted Barrel, else best QoL (handling, range, stability) until better roll. Mag: prefer Ionized Heatsink else best reducing heat generation from its very high basestat of 90 (target 60), else next best reducing heat generation or increasing cooling efficiency until better roll. Prefer Destabilizing Rounds but Cooling Baubles is a solid alternative for dealing with heat buildup.",
            "hash": 2819552809,
            "name": "(Basic)(PvE) Compact Defender for damage",
            "plugs": [
                [
                    2048641572,
                    3932949589
                ],
                [
                    1909124648,
                    2109543898
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "description": "(Basic)(PvE)(Tier:A)(MW:Heat Generation or Cooling Efficiency) Barrel: prefer Fluted Barrel, else best QoL (handling, range, stability) until better roll. Mag: prefer Ionized Heatsink else best reducing heat generation from its very high basestat of 90 (target 60), else next best reducing heat generation or increasing cooling efficiency until better roll. Destabilizing Rounds pairs very well with Repulsor Brace for generating overshield.",
            "hash": 2819552809,
            "name": "(Basic)(PvE) Compact Defender for overshield",
            "plugs": [
                [
                    2048641572
                ],
                [
                    776531651
                ]
            ],
            "tags": [
                "PVE"
            ]
        },
        {
            "description": "(Basic)(PvP)(Tier:B)(MW:Range) Low range so prioritize range and stability. Barrel: prefer Fluted Barrel, else select for QoL (handling, range, stability) until better roll. Mag: prefer Ionized Heatsink for best reducing heat generation from its very high basestat of 90 (target 60), else next best reducing heat generation or improving cooling efficiency until better roll. Perk 1: prefer Range Finder for +10 Range on ADS else Delicate Tuning but pace shots to keep heat below 50%. Perk 2: Kill Clip (neutral build) or Desperate Measures (good for melee/grenade builds).",
            "hash": 2819552809,
            "name": "(Basic)(PvP) Compact Defender ",
            "plugs": [
                [
                    2846385770,
                    307683764
                ],
                [
                    1015611457,
                    2109543898
                ]
            ],
            "tags": [
                "PVP"
            ]
        }
    ]
}